Ray-Garraty/esp32-rs-on-idf6/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
# IWDT (Interrupt Watchdog Timer) — catches spinlock deadlocks and
# interrupts-disabled-too-long conditions. Uses MWDT in Timer Group 1.
# When interrupts are disabled (portENTER_CRITICAL), the tick interrupt
# can't fire → IWDT timeout → panic with backtrace → stage 2 hard reset.
# LL-031/LL-032: This is the primary defense against silent GPIO spinlock
# deadlocks that TWDT cannot detect (interrupts disabled).
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=500

# RWDT (RTC Watchdog) — ultimate protection against complete system hangs
# where even IWDT's panic handler cannot run. Keep bootloader's RWDT
# enabled and re-configure in app_main with 6s timeout → RESET_SYSTEM.
# Fed from main loop every 10ms.
CONFIG_BOOTLOADER_WDT_DISABLE_IN_USER_CODE=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL_ERROR=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# CONFIG_ESP_CONSOLE_NONE is not set
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=12288
CONFIG_BT_NIMBLE_ACL_BUF_COUNT=6
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=12
CONFIG_BT_NIMBLE_MAX_CCCDS=2
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=1

# Larger factory partition (1500K) for network-enabled firmware
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# WiFi / HTTP / LWIP
CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=4
CONFIG_HTTPD_WS_SUPPORT=y
# CONFIG_MDNS_MAX_SERVICES=1  # requires esp_mdns from IDF Component Registry

# PSRAM — ESP32-S3 has 8 MB octal PSRAM (Espressif ESP32-S3-DevKitC-1)
# Use PSRAM aggressively for heap allocations via caps, but keep DMA-critical
# and time-critical allocations in internal DRAM (MALLOC_CAP_INTERNAL).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
# Allow code fetch from PSRAM (slower but frees IRAM for critical ISRs)
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
# Allow read-only data in PSRAM (relieves DRAM pressure from constants)
CONFIG_SPIRAM_RODATA=y
# Speed: 80 MHz for octal PSRAM on ESP32-S3
CONFIG_SPIRAM_SPEED_80M=y

# PSRAM for WiFi and LWIP — allocate WiFi/LWIP buffers in PSRAM first,
# fall back to internal DRAM if PSRAM is insufficient. This frees ~12 KB
# of internal DRAM for the HTTP server and BLE, resolving the DRAM
# fragmentation that blocked the captive portal (see GR-3).
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
